---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySketchGridWarn
source: html/233b1a89-40af-97cc-9522-c83de4fd5185.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySketchGridWarn Property

Work Planes cannot be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopySketchGridWarn { get; }
```